In [3]:
import numpy as np, pandas as pd

In [4]:
pd.Series([1,2,3],dtype=float)

0    1.0
1    2.0
2    3.0
dtype: float64

In [5]:
df['Var']=None

NameError: name 'df' is not defined

In [6]:
# ブロードキャスト
# シェイプが異なる多次元配列同士の演算を可能にする仕組み

In [7]:
df = pd.DataFrame(np.arange(2,8).reshape(2,3))

In [8]:
df

   0  1  2
0  2  3  4
1  5  6  7

In [9]:
df//2

   0  1  2
0  1  1  2
1  2  3  3

In [10]:
df + [2,1,0]

   0  1  2
0  4  4  4
1  7  7  7

In [11]:
(df.T +[3,0]).T

   0  1  2
0  5  6  7
1  5  6  7

In [16]:
# 条件抽出
df = pd.DataFrame(np.arange(8).reshape(4,2),
                  columns=['A','B'])

In [17]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7

In [18]:
i,j=2,5

In [19]:
df[(df.A==i)|(df.B==j)]

   A  B
1  2  3
2  4  5

In [20]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7

In [21]:
df.A

0    0
1    2
2    4
3    6
Name: A, dtype: int64

In [22]:
df.query('A==@i or B==@j')

   A  B
1  2  3
2  4  5

In [23]:
# ユニバーサル関数
# DataFrameを引数にとって、要素ごとに演算し、元のDataFrameと同じシェイプで返す関数

In [25]:
df= pd.DataFrame(np.arange(2,8).reshape(2,3))

In [26]:
df

   0  1  2
0  2  3  4
1  5  6  7

In [27]:
np.less(df,5)

       0      1      2
0   True   True   True
1  False  False  False

In [28]:
df.apply(lambda v:v<5)

       0      1      2
0   True   True   True
1  False  False  False

In [ ]:
# 軸で演算する関数